<?php
//APP控制起
namespace Common\Controller;
class AppController extends AppframeController {

    protected $token ="0";
    protected $uid ="0";
    protected $mobile = "0";
    protected $userinfo = array();
    protected $language="zw";
    protected $e_zw = array(
        0 => "正常",
        102 => "维护中，请稍后再进行登录",
        103 => "系统繁忙，请稍后再试",
        104 => "二级密码错误",
        105 => "二级密码未设置，请设置后再来",
        106 => "二级密码添加成功",
        107 => "登录密码输入有误",
        108 => "请输入正确的兑换地址",
        109 => "二级密码设置相同",

        1001 => "当前网络不佳，请稍后再试",
        1003 => "签名信息错误",

        2000 => "该手机号暂未注册",
        2001 => "请输入正确的手机号码",
        2002 => "密码不符合要求，请输入6到18位的字母与数字密码组合",
        2003 => "手机号不能为空",
        2004 => "注册失败",
        2005 => "帐号不能为空",
        2006 => "密码不能为空",
        2007 => "登录失败",
        2008 => "原密码不正确",
        2009 => "修改密码失败",
        2010 => "该手机号已注册",
        2011=>"验证码错误",
        2012=>"验证码不能为空",
        2013=>"邀请人手机号不能为空",
        2014=>"真实姓名不能为空",
        2015=>"激活码不正确或者已经被使用，请尝试登陆",
        2016=>"所填邀请人不存在",
        2017=>"账号被封，请联系管理员",
        2018=>"验证码发送失败",
        2019=>"手机号被加入黑名单",
        2020=>"IP被加入黑名单",
        2021=>"我们发布了新的版本哦，请及时下载更新",
        2022=>"账号尚未激活，请联系推荐人激活",
        2023=>"验证码已发送至您的手机（5分钟有效）",
        2024=>"今日注册用户量已达到上限，请明日再试（每天9点重置）",
        2025=>"您当前登录密码过于简单，请通过找回密码修改为6到18位的字母与数字密码组合",
        2026=>"新密码不能与原密码一样",
        2027=>"邀请人被冻结,请联系邀请人",
        2028=>"昵称不能为空",
        2029=>"请输入正确的登录密码",
        2030=>"账户删除失败",
        2031=>"非常抱歉，您输入的密码有误！",
        2032=>"激活码数量不足！",
        2033=>"激活失败！",
        2034=>"用户已经激活！",
        2035=>"只能赠送给您推荐的人！",
        2036=>"请输入正确的数量！",
        2037=>"数量不足！",
        2038=>"账户已被激活！",

        2100 => "您暂未登录，请登录后操作",
        2101 => "由于您过长时间未登录,请重新登录",
        2102 => "请输入原密码与新密码",
        2103 => "不存在有效用户",


        3000=>"商品信息获取失败",
        31001 => "所选代金券出错，请重新选择",
        31002 => "所选代金券金额必须小于商品价格",
        31003 => "该商品无法使用代金券",

        6001 => "没有接收到身份证图片",
        6002 => "当前身份证号已用于其他账号绑定",
        6003 => "请填写真实的身份证号码",
        6004 => "请填写姓名",
        6005 => "您已通过实名认证",
        6006 => "身份证被加入黑名单",
        6007 => "只允许18到60周岁用户注册",
        6008 => "请重新进行滑动验证",
        6014 => "文章不存在",
        6015 => "实名认证失败",
        6101 => "您还没有通过实名认证",

        6102 => "暂时没有常见问题",
        6103 => "文章id不能为空",
        6104 => "无文章详情",
        6105 => "暂时没有系统反馈",
        6106 => "反馈内容不能为空",
        6107 => "反馈内容类型不能为空",
        6108 => "消息获取失败",
        6109 => "您已被禁止留言",
        6110 => "消息删除失败",

        61101 => "暂时没有官方动态",
        61102 => "暂时没有常见问题",
        61103 => "文章id不能为空",
        61104 => "无文章详情",
        61105 => "暂时没有系统反馈",
        61106 => "反馈内容不能为空",
        61107 => "反馈内容类型不能为空",
        61108 => "消息获取失败",
        61109 => "您已被禁止留言",
        61110 => "当前分类禁止留言,请到其他分类留言",

        7001 => "暂时没有商品",
        7002 => "商品ID不能为空",
        7003 => "系统繁忙，请稍后再试",
        7004 => "未填写收货地址",
        7010 => "当前购买的商品不存在",
        7011 => "商品数量不能为空",
        7012 => "收货人手机号不为空",
        7013 => "收货人不为空",
        7014 => "暂时没有订单",
        7015 => "当前钱包余额不足",
        7016 => "留言已提交，请不要重复提交相同内容！",
        7017 => "留言过于频繁，请稍后再试",
        7018 => "超过每日购买额度",
        7019 => "订单已确认，请返回刷新查看",
        7020 => "操作失败,请重试",
        7021 => "当前商品剩余量不足",
        7022 => "地址添加失败，请重试",
        7023 => "购买留言必需在200字内",
        7024 => "请选择正确的收货地址",
        7025 => "收货地址最大条数为5条",
        7026 => "请选择支付方式",
        7027 => "当前积分不足，无法购买",
        7028 => "存在未处理留言",
        7029 => "该商品已下架，暂时无法购买",
        7030 => "该商品暂无评价",
        7031 => "评价失败，请刷新后重试",
        7032 => "当前商品最少份数为100",
        7033 => "购买失败，请至玩币网确认账号是否存在",
        7034 => "请选择需要购买的商品",
        7035 => "您的等级暂不符合购买条件",
        7036 => "当前对应钱包积分不足，无法购买",
        7037 => "超出该商品所能购买的件数",
        7038 => "该商品目前无法确认收货",
        7039 => "该商品请在报单中心界面购买",

        7101 => "该订单异常，无法继续",
        7102 => "该订单不存在或者已删除，请刷新重试",
        7103 => "该订单已付款，无法删除",
        7104 => "申请失败",

        7200 => "打款人不能为空",
        7201 => "打款账户不能为空",
        7202 => "打款账户长度不对",
        7203 => "转账记录信息添加失败",

        13001 => "您今天已经签到过了哦",
        13002 => "剩余游戏次数不足",
        13003 => "您的积分数不足，无法进行游戏",

        14001 => '请输入接收者手机号',
        14002 => '请输入接收者真实姓名',
        14003 => '请输入自己的登录密码',
        14004 => '接收者信息错误或未通过实名认证',
        14005 => '当前操作的代金券出错，请返回列表刷新后操作',
        14006 => '登录密码错误',
        14007 => '操作失败，请稍后再试',
        14008 => '代金券不能赠送给自己',
        14009 => '代金券暂时只能赠送您的推荐人或您推荐的人',

        15001 => '提取的积分数不能留空',
        15002 => '积分数不足',
        15003 => '钱包地址不正确',
        15004 => '系统繁忙，请稍后再试',
        15005 => '用户密码错误',
        15006 => '暂未绑定钱包地址',
        15007 => '钱包地址已添加，请勿重新提交',
        15008 => '钱包地址相同，请勿重新提交',
        15009 => '请选择交易所',
        15010 => '暂不支持该交易平台',

        16001 => '请填入完整信息',
        16002 => '操作错误，请刷新重试',
        16003 => '填写的银行卡号有误',
        16004 => '你填写合适的转账人姓名',
        16005 => '当前系统繁忙，请稍后在再试',
        16006 => '所选支付方式暂不可用',
        16007 => '请输入合适的充值金额',
        16008 => '请等待您的其他充值单审核',
        16009 => '当前充值方式单次最大充值金额为10000',

        17001 => '存在未出场单，无法再次排单',
        17002 => '您的积分不足，最小排单额为100',
        17003 => '当前排单还没到出场时间',
        17004 => '请输入合适的提取积分数',
        17005 => '当前钱包积分不足',
        17006 => '您的排单币数量不足',

        20001 => '购买总额应该在1000到30000',
        20002 => '漫香积分与排单额总和不能超过30000',
        20003 => '当前钱包兑换最小额度为500',
        20004 => '当前钱包兑换最小额度为100',
        20005 => '请输入100的整数倍值',
        20006 => '暂未开放',
        20007 => '推广与收益兑换总额不能超过30000',

    );


    protected $url = "http://192.168.1.243/App/Passport/register?sig=029fcea71f49c374420baf3140ced56f&mobile=15671132517";
    protected $auth = "Mx2017"; //加密的KEY

    //sig=a57985dd99f02df991ca9c6b0ccc77ff

    public function _initialize()
    {
        //验证服务器是否关闭
        $status =D("Passport")->is_open();
        if(!$status){
            $this->exitJson(102);
        }



        $sig = $_REQUEST["sig"];
        $this->mobile = empty($_REQUEST["mobile"]) ? 0 : I("mobile");
        $this->token = empty($_REQUEST["token"]) ? "0" : I("token");
        //$this->language=empty($_REQUEST["language"])?NUll:I("language");

        if (empty($sig) && ACTION_NAME!="alipay_callback" ) {
            $this->exitJson(1001);
        }
        if (strtolower($_REQUEST["sig"]) != md5($this->auth) && ACTION_NAME!="alipay_callback") {
            $this->exitJson(1003);
        }

        if (!empty($this->mobile)) {
            $this->uid = getId($this->mobile);
            if(!empty($this->uid)){
                $this-> userinfo = getUserInfoById($this->uid);
            }
        }

//        if(!empty($this->userinfo)){
//            if(
//                ACTION_NAME!="message_list" && ACTION_NAME!="message_type"
//                && ACTION_NAME!="reply_info" && ACTION_NAME!="message_add"
//                && ACTION_NAME!="user_reply" && ACTION_NAME!="getDynamic"
//                && ACTION_NAME!="getContent" && ACTION_NAME!="getHelp"
//                && ACTION_NAME!="login" && ACTION_NAME!="index"
//                && ACTION_NAME!="avatar" && ACTION_NAME!="get_record"
//                && ACTION_NAME!="message_shop_list" && ACTION_NAME!="message_shop_type"
//                && ACTION_NAME!="reply_info_shop" && ACTION_NAME!="message_shop_add"
//                && ACTION_NAME!="user_reply_shop" && ACTION_NAME!="message_lists"
//                && ACTION_NAME!="not_read_lists" && ACTION_NAME!="message_info"
//                && ACTION_NAME!="getContent" && ACTION_NAME!="getcontent"
//                && ACTION_NAME!="not_read_lists" && ACTION_NAME!="message_info"
//
//            ){
//                if($this->userinfo["user_status"]==0){
//                    $this->exitJson(2017);//账号被封
//                }
//            }
//        }



    }

    protected function exitJson($status, $data = "") {
        $arr = array(
            "error_code" => $status,
        );
        if (is_array($data)) {
            $arr["data"] = $data;
        } elseif(!empty($data)){
            $arr["error"] = $data;
        }else {
            if($this->language=="zw"){
                $arr["error"] = $this->e_zw[$status];
            }elseif($this->language=="ft"){
                $arr["error"] = $this->e_ft[$status];
            }else{
                $arr["error"] = $this->e_en[$status];
            }
        }
        echo json_encode($arr);
        exit();
    }
}
